Tekla Open API Reference for Tekla Structures 2025
RebarItem.Select Method (String, String, String)
 Selects the rebar item in the rebar database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	string Grade,
	string Size,
	string Usage
)
Public Function Select (
	Grade As String,
	Size As String,
	Usage As String
) As Boolean
Parameters
Grade
Type: System.String
The grade of the rebar item to select.
Size
Type: System.String
The size of the rebar item to select.
Usage
Type: System.String
The usage of the rebar item to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
RebarItem Class
Select Overload
Tekla.Structures.Catalogs Namespace